## Introduction

**Welcome to the Connecting Python to SQL lab!**

In this lab, you will be working with the Sakila database on movie rentals. Specifically, you will be practicing how to do basic SQL queries using Python. By connecting Python to SQL, you can leverage the power of both languages to efficiently manipulate and analyze large datasets. Throughout this lab, you will practice how to use Python to retrieve and manipulate data stored in the Sakila database using SQL queries. Let's get started!

---

## Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. **Establish a connection between Python and the Sakila database.**

2. **Write a Python function called `rentals_month`** that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

   - `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
   - `month`: an integer representing the month for which rental data is to be retrieved.
   - `year`: an integer representing the year for which rental data is to be retrieved.

   The function should execute a SQL query to retrieve the rental data for the specified month and year from the `rental` table in the Sakila database, and return it as a pandas DataFrame.

3. **Develop a Python function called `rental_count_month`** that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each `customer_id` during the selected month and year.

   The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

   *Hint: Consider making use of pandas `groupby()`.*

4. **Create a Python function called `compare_rentals`** that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy as sa
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
engine.connect()

In [7]:
# Ensuring the connection was succesful by retrieving sample data
inventory = pd.read_sql('SELECT * FROM inventory limit 5', engine)
inventory.head()

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17
2             3        1         1 2006-02-15 05:09:17
3             4        1         1 2006-02-15 05:09:17
4             5        1         2 2006-02-15 05:09:17

In [6]:
# Retrieve rental data for a given month and year from the Sakila database.
def rentals_month(engine, month, year):
    # Using a parameterized query
    query = """
    SELECT * 
    FROM rental 
    WHERE MONTH(rental_date) = %s AND YEAR(rental_date) = %s
    """
    df = pd.read_sql(query, engine, params=(month, year))
    return df

In [9]:
#Return a DataFrame containing the number of rentals made by each customer_id during the selected month and year.
    
def rental_count_month(df, month, year):
    rental_count = df.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')
    return rental_count

In [20]:
# def rental_count_month(df, month, year):
#     # Step 1: Group the DataFrame by 'customer_id'
#     grouped = df.groupby('customer_id')
    
#     # Step 2: Count the number of rows for each group
#     rental_counts = grouped.size()
    
#     # Step 3: Reset the index
#     rental_counts_reset = rental_counts.reset_index()
    
#     # Step 4: Rename the column that holds the counts
#     column_name = f'rentals_{month}_{year}'
#     rental_counts_reset.columns = ['customer_id', column_name]
#     return rental_counts_reset

In [21]:
# Return a combined DataFrame with a 'difference' column.

def compare_rentals(df1, df2):
    merged = pd.merge(df1, df2, on='customer_id', how='inner')
    cols = merged.columns[1:]
    merged['difference'] = abs(merged[cols[1]] - merged[cols[0]])
    return merged

In [24]:
data_may = rentals_month(engine, 5, 2005)
data_june = rentals_month(engine, 6, 2005)

count_may = rental_count_month(data_may, 5, 2005)
count_june = rental_count_month(data_june, 6, 2005)

comparison = compare_rentals(count_may, count_june)
comparison

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1               2               7           5
1              2               1               1           0
2              3               2               4           2
3              5               3               5           2
4              6               3               4           1
..           ...             ...             ...         ...
507          594               4               6           2
508          595               1               2           1
509          596               6               2           4
510          597               2               3           1
511          599               1               4           3

[512 rows x 4 columns]